# 1) Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

# для первой четверти x ≥ 0 и y ≥ 0;
# для второй четверти x ≤ 0 и y ≥ 0;
# для третьей четверти x ≤ 0 и y ≤ 0;
# для четвертой четверти x ≥ 0 и y ≤ 0.

x = int
y = int
i = str(input("i"))
ii = str(input("ii"))
iii = str(input("iii"))
iv = str(input("iv"))

i = (x > 0 and x < 10) and (y > 0 and y < 10)
ii = (x < 0 and x > -10) and (y > 0 and y < 10)
iii = (x < 0 and x > -10) and (y < 0 and y > -10)
iv = (x > 0 and x < 10) and (y < 0 and y > -10)
